import os, sys


print ("")  
print ("███████╗██╗  ██╗██╗   ██╗     ██╗  ██╗██╗  ██╗██╗  ██╗ ██████╗ ██████╗  ")         
print ("██╔════╝██║ ██╔╝╚██╗ ██╔╝     ██║  ██║██║  ██║╚██╗██╔╝██╔═══██╗██╔══██╗ ")       
print ("███████╗█████╔╝  ╚████╔╝      ███████║███████║ ╚███╔╝ ██║   ██║██████╔╝ ")         
print ("╚════██║██╔═██╗   ╚██╔╝       ██╔══██║╚════██║ ██╔██╗ ██║   ██║██╔══██╗   ")       
print ("███████║██║  ██╗   ██║███████╗██║  ██║     ██║██╔╝ ██╗╚██████╔╝██║  ██║██╗  ")     
print ("╚══════╝╚═╝  ╚═╝   ╚═╝╚══════╝╚═╝  ╚═╝     ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═╝╚═╝    ") 
print ("                                        /=\        |        |         ") 
print ("                                         \  /=| /= =/ /=\ /=| /=\ /== ") 
print ("                                        \=/ \=| |  |\ \=/ \=| \=  ==/  ")   
print ("													")
print (" ========================================================")
print ("👽 Telegram Member Pro 💪")
print (" ========================================================")
print ("")



print('Pakages Installing Started')
os.system('pip install telethon==1.24.0')
os.system('pip install colorama==0.4.3')
os.system('pip install requests==2.25.1')
os.system("cls" if os.name=='nt' else 'clear')
print ('All Pakages Installed Successfully')         
                                          
                                          
                                                       
                                                                                   
                                                                                  
                                         